In [72]:
import pandas as pd
import numpy as np

In [73]:
print(f"Version {pd.__version__}")

Version 1.0.1

### Series数据结构

In [74]:
s = pd.Series()
s

E:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

Series([], dtype: float64)

In [75]:
s = pd.Series(np.array(['a','b','c']))
s

0    a
1    b
2    c
dtype: object

In [76]:
s = pd.Series(['1','a','3',2])
s

0    1
1    a
2    3
3    2
dtype: object

In [77]:
# 字典的 key 即为标签
dic = {'name':'luo', 'age':25, 'sex':'F'}
s = pd.Series(dic)
s

name    luo
age      25
sex       F
dtype: object

In [78]:
# 通过 标量
s = pd.Series(2, index=[0, 1, 2])
s

0    2
1    2
2    2
dtype: int64

In [79]:
# 指定下标
s = pd.Series(np.arange(3), index=list('ABC'))
s

A    0
B    1
C    2
dtype: int32

#### 获取数据

In [80]:
data = s[1]
print('通过索引取值：{}'.format(data))

通过索引取值：1

In [81]:
data = s[['B','A']]     
print('通过标签取值：\n{}'.format(data))

通过标签取值：
B    1
A    0
dtype: int32

In [82]:
data = s['A':'C']       
print('通过标签取值：\n{}'.format(data))

通过标签取值：
A    0
B    1
C    2
dtype: int32

In [128]:
test = pd.Series([3,2,1,4])
test

0    3
1    2
2    1
3    4
dtype: int64

In [129]:
test.values

array([3, 2, 1, 4], dtype=int64)

In [130]:
test.index

RangeIndex(start=0, stop=4, step=1)

In [132]:
test = pd.Series([3,2,1,4],index=['a','b','c','d'])
test

a    3
b    2
c    1
d    4
dtype: int64

In [133]:
test[test>2]

a    3
d    4
dtype: int64

In [134]:
test+2

a    5
b    4
c    3
d    6
dtype: int64

In [135]:
test*3

a     9
b     6
c     3
d    12
dtype: int64

In [136]:
# 通过dict 初始化

data = {'score':100,'age':18,'gap':3.5}
stu=pd.Series(data)
stu

score    100.0
age       18.0
gap        3.5
dtype: float64

In [137]:
data = {'score':100,'age':18,'gpa':3.5}
idx =['score','age','gpa','courses']
stu=pd.Series(data,index=idx)
stu

score      100.0
age         18.0
gpa          3.5
courses      NaN
dtype: float64

## DataFrame

In [83]:
lists = [{'name':'Bob','age':22,'sex':'F'},
        {'name':'Tom','age':21,'sex':'F'},
        {'name':'Andy','sex':'M'}]
df = pd.DataFrame(lists)
df

   name   age sex
0   Bob  22.0   F
1   Tom  21.0   F
2  Andy   NaN   M

In [84]:
# 简单一维数组

lists = ['Bob','Tom','Andy']
df = pd.DataFrame(lists)
df

      0
0   Bob
1   Tom
2  Andy

In [85]:
# 二维数组
lists = [['Bob',25],['Tom',23],['Andy',19]]
# 传入数据，并指定列标签
df = pd.DataFrame(lists, columns=['name','age'])
df

   name  age
0   Bob   25
1   Tom   23
2  Andy   19

In [86]:
# 通过Series 创建
s = pd.Series(['Bob','Tom','Andy'], index=['first','second','third'])
df = pd.DataFrame(s, columns=['name'])
df

        name
first    Bob
second   Tom
third   Andy

#### 增删操作

In [87]:
# 数据样本
index = pd.date_range('20190217', periods=7)
columns = list('ABCD')
df = pd.DataFrame(np.random.randn(7,4), index=index, columns=columns)
df

                   A         B         C         D
2019-02-17 -0.232709 -1.354094 -0.988170 -0.353183
2019-02-18 -1.045534  0.665712 -0.671792 -0.141542
2019-02-19  1.918381  1.323906  1.341429 -1.924982
2019-02-20  0.582364 -0.216463  1.083812  1.539157
2019-02-21  0.910252 -0.473836 -0.179603 -0.107536
2019-02-22 -1.437790  0.730053 -1.869988  1.039459
2019-02-23  0.234224  0.348166  0.739172 -0.689217

In [88]:
# 添加列
df['E'] = 1
df

                   A         B         C         D  E
2019-02-17 -0.232709 -1.354094 -0.988170 -0.353183  1
2019-02-18 -1.045534  0.665712 -0.671792 -0.141542  1
2019-02-19  1.918381  1.323906  1.341429 -1.924982  1
2019-02-20  0.582364 -0.216463  1.083812  1.539157  1
2019-02-21  0.910252 -0.473836 -0.179603 -0.107536  1
2019-02-22 -1.437790  0.730053 -1.869988  1.039459  1
2019-02-23  0.234224  0.348166  0.739172 -0.689217  1

In [89]:
# 删除列
df.pop('E') 
df

                   A         B         C         D
2019-02-17 -0.232709 -1.354094 -0.988170 -0.353183
2019-02-18 -1.045534  0.665712 -0.671792 -0.141542
2019-02-19  1.918381  1.323906  1.341429 -1.924982
2019-02-20  0.582364 -0.216463  1.083812  1.539157
2019-02-21  0.910252 -0.473836 -0.179603 -0.107536
2019-02-22 -1.437790  0.730053 -1.869988  1.039459
2019-02-23  0.234224  0.348166  0.739172 -0.689217

In [90]:
# 删除多列
data = df.drop(columns=['A','D'])
data

                   B         C
2019-02-17 -1.354094 -0.988170
2019-02-18  0.665712 -0.671792
2019-02-19  1.323906  1.341429
2019-02-20 -0.216463  1.083812
2019-02-21 -0.473836 -0.179603
2019-02-22  0.730053 -1.869988
2019-02-23  0.348166  0.739172

In [91]:
# 删除行
data = df.drop(index=index[:3])
data

                   A         B         C         D
2019-02-20  0.582364 -0.216463  1.083812  1.539157
2019-02-21  0.910252 -0.473836 -0.179603 -0.107536
2019-02-22 -1.437790  0.730053 -1.869988  1.039459
2019-02-23  0.234224  0.348166  0.739172 -0.689217

#### 选择

In [92]:
# 使用行标签

data = df.loc['20190217']
data

A   -0.232709
B   -1.354094
C   -0.988170
D   -0.353183
Name: 2019-02-17 00:00:00, dtype: float64

In [93]:
# 使用列标签


data = df.loc[:,'A':'D']
data

                   A         B         C         D
2019-02-17 -0.232709 -1.354094 -0.988170 -0.353183
2019-02-18 -1.045534  0.665712 -0.671792 -0.141542
2019-02-19  1.918381  1.323906  1.341429 -1.924982
2019-02-20  0.582364 -0.216463  1.083812  1.539157
2019-02-21  0.910252 -0.473836 -0.179603 -0.107536
2019-02-22 -1.437790  0.730053 -1.869988  1.039459
2019-02-23  0.234224  0.348166  0.739172 -0.689217

In [94]:
# 行标签 + 列标签 


data = df.loc['2019-02-17':'2019-02-19',['A','C']]
data

                   A         C
2019-02-17 -0.232709 -0.988170
2019-02-18 -1.045534 -0.671792
2019-02-19  1.918381  1.341429

#### 索引函数 .iloc

In [109]:
# a. 行索引
data = df.iloc[1:3]
data

        a    b    c    d
four  NaN  NaN  NaN  NaN
two   4.0  5.0  6.0  7.0

In [110]:
# b. 列索引
data = df.iloc[:,[2,3]]
data

         c    d
first  2.0  3.0
four   NaN  NaN
two    6.0  7.0

In [126]:
# c. 行索引 + 列索引
data = df.iloc[[1,3],[0,2]]
data

   name  year
1   Tom  2014
3  tony  2013

In [112]:
# 测试数据
df = pd.DataFrame(np.arange(12).reshape(3,4), index=['first','two','three'], columns=list('abcd')) 
df = df.reindex(['first','two','four'])                                                            
df

         a    b    c    d
first  0.0  1.0  2.0  3.0
two    4.0  5.0  6.0  7.0
four   NaN  NaN  NaN  NaN

In [113]:
# 判断 null
df.isnull()

           a      b      c      d
first  False  False  False  False
two    False  False  False  False
four    True   True   True   True

In [114]:
df.a.notnull()

first     True
two       True
four     False
Name: a, dtype: bool

In [115]:
# 计算sum，NA会被视为0   
print(df.loc['four'].sum())

0.0

In [116]:

# 丢去 NA 部分                                                          
data = df.dropna()                                                   
data

         a    b    c    d
first  0.0  1.0  2.0  3.0
two    4.0  5.0  6.0  7.0

In [117]:
# 填充 NA 部分                                                           
data = df.fillna(0)                                                  
data

         a    b    c    d
first  0.0  1.0  2.0  3.0
two    4.0  5.0  6.0  7.0
four   0.0  0.0  0.0  0.0

In [118]:
# 使用填充模式                                                               
data = df.fillna(method='ffill')  #向前填充                                   
data

         a    b    c    d
first  0.0  1.0  2.0  3.0
two    4.0  5.0  6.0  7.0
four   4.0  5.0  6.0  7.0

In [119]:
data = df.ffill()                                                    
data

         a    b    c    d
first  0.0  1.0  2.0  3.0
two    4.0  5.0  6.0  7.0
four   4.0  5.0  6.0  7.0

In [120]:
df

         a    b    c    d
first  0.0  1.0  2.0  3.0
two    4.0  5.0  6.0  7.0
four   NaN  NaN  NaN  NaN

In [121]:
df = df.reindex(['first','four','two'])                              
df

         a    b    c    d
first  0.0  1.0  2.0  3.0
four   NaN  NaN  NaN  NaN
two    4.0  5.0  6.0  7.0

In [122]:
# 替换 replace()                                                      
data = df.replace({np.nan:0,3:33})                                   
data

         a    b    c     d
first  0.0  1.0  2.0  33.0
four   0.0  0.0  0.0   0.0
two    4.0  5.0  6.0   7.0

#### 分组

In [123]:
# 测试数据
df = pd.DataFrame({
    'name':['Tom','Tom','Andy','tony','Andy','Tom','tony'],
    'rank':[1,2,3,1,4,3,2],
    'year':[2016,2014,2015,2013,2012,2009,2011]
})
df

   name  rank  year
0   Tom     1  2016
1   Tom     2  2014
2  Andy     3  2015
3  tony     1  2013
4  Andy     4  2012
5   Tom     3  2009
6  tony     2  2011

In [124]:
# 拆封成组
grouped = df.groupby(by='name') # by：映射，函数，str或可迭代对象
grouped

In [125]:
# 查看分组
grouped.groups

{'Andy': Int64Index([2, 4], dtype='int64'),
 'Tom': Int64Index([0, 1, 5], dtype='int64'),
 'tony': Int64Index([3, 6], dtype='int64')}

#### map / apply

In [161]:
df=pd.DataFrame(np.arange(12).reshape(3,4))
df

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [162]:
df.apply(np.square)

    0   1    2    3
0   0   1    4    9
1  16  25   36   49
2  64  81  100  121

In [163]:
new_df= df.apply(lambda x:x+1)
new_df

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [164]:

# 每列最大值
df.apply(lambda x:x.max())

0     8
1     9
2    10
3    11
dtype: int64

In [165]:
df.describe()

         0    1     2     3
count  3.0  3.0   3.0   3.0
mean   4.0  5.0   6.0   7.0
std    4.0  4.0   4.0   4.0
min    0.0  1.0   2.0   3.0
25%    2.0  3.0   4.0   5.0
50%    4.0  5.0   6.0   7.0
75%    6.0  7.0   8.0   9.0
max    8.0  9.0  10.0  11.0

In [166]:
df.apply(lambda x:pd.Series([x.min(),x.max(),x.std()],index=['min','max','std']))

       0    1     2     3
min  0.0  1.0   2.0   3.0
max  8.0  9.0  10.0  11.0
std  4.0  4.0   4.0   4.0

In [167]:
df.applymap(lambda x:"{:.0%}".format(x))

      0     1      2      3
0    0%  100%   200%   300%
1  400%  500%   600%   700%
2  800%  900%  1000%  1100%

In [168]:
df.applymap(lambda x:'%.2f' % x)

      0     1      2      3
0  0.00  1.00   2.00   3.00
1  4.00  5.00   6.00   7.00
2  8.00  9.00  10.00  11.00

#### Sort

In [171]:
df=pd.DataFrame(np.random.randn(3,4),index=['c','b','a'],columns=[4,1,3,2])
df

          4         1         3         2
c -1.423425  0.948817 -0.821920 -0.650972
b -0.563781  0.462083 -0.368414  1.878584
a -1.161747  1.104877 -0.179673  1.075110

In [172]:
df.sort_index()

          4         1         3         2
a -1.161747  1.104877 -0.179673  1.075110
b -0.563781  0.462083 -0.368414  1.878584
c -1.423425  0.948817 -0.821920 -0.650972

In [174]:
df.sort_index(axis=1,ascending=False)

          4         3         2         1
c -1.423425 -0.821920 -0.650972  0.948817
b -0.563781 -0.368414  1.878584  0.462083
a -1.161747 -0.179673  1.075110  1.104877

#### 根据值排序

In [175]:
df.sort_values(by=4)

          4         1         3         2
c -1.423425  0.948817 -0.821920 -0.650972
a -1.161747  1.104877 -0.179673  1.075110
b -0.563781  0.462083 -0.368414  1.878584

#### 汇总运算

In [176]:
df.sum()

4   -3.148953
1    2.515778
3   -1.370007
2    2.302721
dtype: float64

In [177]:
df.sum(axis=1)

c   -1.947501
b    1.408472
a    0.838567
dtype: float64

In [178]:
df.mean()

4   -1.049651
1    0.838593
3   -0.456669
2    0.767574
dtype: float64

In [179]:
df.mean(axis=1)

c   -0.486875
b    0.352118
a    0.209642
dtype: float64